# 8. Логические выражения
# 1. Замените три точки в условиях правильным логическим оператором and или or.

for current_hour in range(0, 24):
    print("На часах " + str(current_hour) + ":00.")
    if current_hour >= 6 and current_hour <= 11 :  
        print('Доброе утро!')
    elif current_hour >= 12 and current_hour <= 17:  
        print('Добрый день!')
    elif current_hour >= 18 and current_hour <= 22:                       
        print('Добрый вечер!')
    elif current_hour <= 5 or current_hour >= 23:
        print('Доброй ночи!')
        
# Результат
# На часах 0:00.
# Доброй ночи!
# На часах 1:00.
# Доброй ночи!
# На часах 2:00.
# Доброй ночи!
# На часах 3:00.
# Доброй ночи!
# На часах 4:00.
# Доброй ночи!
# На часах 5:00.
# Доброй ночи!
# На часах 6:00.
# Доброе утро!
# На часах 7:00.
# Доброе утро!
# На часах 8:00.
# Доброе утро!
# На часах 9:00.
# Доброе утро!
# На часах 10:00.
# Доброе утро!
# На часах 11:00.
# Доброе утро!
# На часах 12:00.
# Добрый день!
# На часах 13:00.
# Добрый день!
# На часах 14:00.
# Добрый день!
# На часах 15:00.
# Добрый день!
# На часах 16:00.
# Добрый день!
# На часах 17:00.
# Добрый день!
# На часах 18:00.
# Добрый вечер!
# На часах 19:00.
# Добрый вечер!
# На часах 20:00.
# Добрый вечер!
# На часах 21:00.
# Добрый вечер!
# На часах 22:00.
# Добрый вечер!
# На часах 23:00.
# Доброй ночи!