# 7. Переменные и типы
# 2. Если Анфиса поселится в фитнес-трекере, она сможет считать количество шагов пользователя.
# Научите Анфису подставлять в сообщение сумму шагов, пройденных за два дня.
# В переменных steps_today и steps_yesterday записано, сколько шагов прошёл незнакомый вам
# Геннадий вчера и сегодня. Напечатайте на экран ответ на вопрос Сколько шагов сделал Геннадий
# за два дня?

steps_today = 6783
steps_yesterday = 8452
steps_sum = steps_today+steps_yesterday  # сумма
print('Сколько шагов сделал Геннадий за два дня?')
print(steps_sum)

# Результат
# Сколько шагов сделал Геннадий за два дня?
# 15235