# 9. Преобразование типов
# Научим Анфису информировать вас о новых сообщениях, которые вы могли бы получить.
# Выведите на экран строку 'У вас 8 новых сообщений', составленную из строки 'У вас ',
# значения переменной count и строки ' новых сообщений'.

count = 8
message = 'У вас ' + str(count) + ' новых сообщений'
print(message)

# Результат
# У вас 8 новых сообщений