# 13. Вывод на экран
# Начнём учить Анфису разговаривать о погоде.
# Напечатайте на экран два сообщения о погоде в следующем формате:
# Сегодня ...
# Температура воздуха ... градусов
# Температура хранится в переменной temperature, а описание погоды — в переменной weather.
# Не изменяйте их значения.

temperature = -25
weather = 'солнечно'
print('Сегодня',weather)
print('Температура воздуха',temperature,'градусов')

# Результат
# Сегодня солнечно
# Температура воздуха -25 градусов