# 16. Списки
# 3. Анфиса должна не только знать ваших друзей, но и рассказывать о каждом из них.
# В переменной index записан номер друга, информация о котором нас интересует.
# Получите из списка friends значение элемента с индексом, сохранённым в переменной index и научите Анфису печатать сообщение:
# {имя друга с номером index} живёт в Красноярске

print("Привет, я Анфиса!")
friends = ['Сергей', 'Соня', 'Дима', 'Алина', 'Егор']
index = 2
print(friends[index],'живет в Красноярске')

# Результат
# Привет, я Анфиса!
# Дима живет в Красноярске