# 16. Списки
# 4. Добавим Анфисе немного функциональности. Научим её считать и перечислять друзей.
# Объявите переменную count и сохраните в ней количество друзей. Посчитайте их вызовом функции len().
# Выведите на экран строку У тебя {количество} друзей, где {количество} — значение переменной count.

print("Привет, я Анфиса!")
friends = ['Сергей', 'Соня', 'Дима', 'Алина', 'Егор']
count = len(friends)
print('У тебя',count,'друзей')

# Результат
# Привет, я Анфиса!
# У тебя 5 друзей